import jwt from "jsonwebtoken";

// ця функція буде провіряти чи може юзер отримати дані при гет запорсі 
// передаючи токен ми його розшифровуєм за допомогою ключа
// в нашому випадку "kybik" і передаєм його в головну перемену 
// req яка буде доступна і нашому роуті з методом гет
// потім провіряжм чи є цей токен і чи розшифровується він
// якщо да то робим next() і продовжуєм писати наш роут
export default (req, res, next) => {

  // витягуєи токен який передаєм в спец полі і забираєм префікс
  const token = (req.headers.authorization || '').replace(/Bearer\s?/, '')


  // провіряєм чи є токен 
  if (token) {
    
    // провірка чи розшифровується токен
    try {

      // розшифровуваня
      const decoded = jwt.verify(token, 'kybik')
      req.userId = decoded._id


      // переходим далі
      next()

// якшо не то помилка 
    } catch (error) {
      return res.status(403).json({
        message: "нет доступа 1",
      });
    }
    // якшо нема то виводим помилку
  } else {
		return res.status(403).json({
			message: "нет доступа 2",
		});
  }

 };
